Repository: Yoz75/WordDegenerator
Catalog: GUI/Localization/*/Resources.resw
Source language: en_us
Languages: ru

# InputTextBoxTooltip.Text
source: The text of this box is used as input for the text generator
ru: Текст отсюда используется в качестве ввода для генератора

# LoadFileButtonTooltip.Text
source: Load the content of input text box from a .txt file (actually you can load all kind of data and get some strange result, but rename the extension of file to .txt)
ru: Загрузить ввод генератора из файла

# ExecuteButtonTooltip.Text
source: Run the generator! Note: try to increase generator's Top K or result length if you see strange output
ru: Запустить генератор! Заметка: попробуйте увеличить Top K или длину результата, если вы видите странный вывод

# SeparatorTokenizerSeparatorTooltip.Text
source: A **single character** that will divide text in separated tokens
ru: **Один символ**, используемый для разделения текста на токены

# BlockTokenizerBlockSizeTooltip.Text
source: Sets the size of each token
ru: Устанавливает размер каждого токена

# StageRepeatTimesTooltip.Text
source: How many times to repeat this stage? The input of every next stage is output of previous
ru: Сколько раз повторить данную стадию? Ввод каждой следующей стадии -- вывод предыдущей

# SmartTokenizerIterationsCountTooltip.Text
source: Sets the count of iterations. Each iterations creates up to one new token from 2 old. The more this value, the longer tokenization will be. Optimal values are in range [1000..10000]
ru: Устанавливает количество итераций токенайзера. Каждая итерация соединяет 2 старых токена в 1 новый.Чем больше это значение, тем дольше будет токенизация, но тем "качественнее" будут токены

# OutputTextBoxTooltip.Text
source: This text box contains output of the generator
ru: Эта область содержит вывод генератора

# SmartTokenizerMaxTokenLengthTooltip.Text
source: Sets the max length of a token. Pairs, that make a token with length, greater than this value, can't be merged. If there's no available pairs, the tokenization stops at this moment.
ru: Устанавливает максимальную длину токена. Пары, которые в совокупности имеют большую длину, не могут быть соединены в следующий токен. Если больше нет пар с удовлетворяющей условия общей диной, токенизация останавливается

# SelectedTokenizerTooltip.Text
source: Selected strategy to create human readable text from tokens graph. Read documentation to learn more about different generator types
ru: Выбранная стратегия для превращения графа токенов в читаемый человеком текст. См. больше в документации

# DefaultGeneratorResultLengthTooltip.Text
source: Sets the count of tokens that should be generated
ru: Устанавливает количество сгенерированных токенов

# SmartTokenizerTopKTooltip.Text
source: Sets the count of most frequent pairs from which 1 will be randomly selected and converted into the next token
ru: Устанавливает количество самых частых пар, среди которых 1 будет случайно выбрана для превращения в токен

# DefaultGeneratorTopKTooltip.Text
source: Sets the count of most frequent next tokens from which 1 will be randomly selected and written into the text. Values like 1 or 2 may give strange results
ru: Установить количество самых частых токенов, среди которых 1 будет случайно выбран и записан в текст. Значения типа 1 или 2 могут создавать странный вывод

# DefaultGeneratorRandomTokenTooltip.Text
source: Sets the chance in range [0..1] of selecting random next token. A value of 1 gives only randomly selected tokens. A value of 0 ensures that only tokens following the previous one are selected (but next token will be randomly generated if there is no subsequent tokens)
ru: Устанавливает вероятность выбора следующего случайного токена в диапазоне [0..1]. Значение 1 означает выбор только случайных токенов. Значение 0 означает выбор только токенов, следующих за предыдущим (однако, следующий токен будет сгенерирован случайным образом, если последующих токенов нет).

# ClearTokenizerCacheTooltip.Text
source: Some tokenizers take too long time to create tokens, so Word Degenerator creates cache for the last tokenization. This button clears the cache and tokenizer must do retokenization next generation
ru: Некоторые токенайзеры занимают слишком большое время для создания токенов, а потому Word Degenerator кеширует последнюю токенизацию. Эта кнопка очищает кеш токенизатора и в следующую генерацию придётся пересоздавать токены

# DefaultGeneratorEnableSeparatorTooltip.Text
source: Enables separator of tokens in output text box when checked
ru: Включить разделитель токенов, когда чекбокс включен

# LoadFileButtonText.Text
source: Load from file
ru: Загрузить из файла

# ExecuteButtonText.Text
source: Run
ru: Выполнить

# StageRepeatTimesHeader.Text
source: Repeat times
ru: Кол-во повторений

# BlockTokenizerBlockSizeText.Text
source: Block size
ru: Размер блока

# SeparatorTokenizerSeparatorText.Text
source: Separator
ru: Разделитель

# SmartTokenizerIterationsCountText.Text
source: Iterations count
ru: Кол-во итераций

# SmartTokenizerMaxTokenLengthText.Text
source: Max token length
ru: Максимальный размер токена

# ClearTokenizerCacheText.Text
source: Clear cache
ru: Очистить кэш

# RandomBlockTokenizerMinSizeTooltip.Text
source: Minimal size of token Should be less or equal to Max token size
ru: Минимальный размер токена. Это значение должно быть меньше максимального размера

# SelectedGeneratorTooltip.Text
source: Selected strategy to tokenize the input text. Read documentation to learn more about different tokenizer types
ru: Выбранная стратегия для токенизации ввода. См. больше в документации

# RandomBlockTokenizerMaxSizeTooltip.Text
source: Maximal size of token. Should be greater or equal to Min token size
ru: Максимальный размер токена. Это значение должно быть больше минимального размера

# SelectedTokenizerText.Text
source: Selected tokenizer
ru: Выбранный токенайзер

# RandomBlockTokenizerMinSizeText.Text
source: Min token size
ru: Минимальный размер токена

# RandomBlockTokenizerMaxSizeText.Text
source: Max token size
ru: Максимальный размер блока

# SelectedGeneratorText.Text
source: Selected generator
ru: Выбранный генератор

# DefaultGeneratorResultLengthText.Text
source: Result Length
ru: Длина результата

# DefaultGeneratorRandomTokenText.Text
source: Random token chance
ru: Шанс случайного токена

# DefaultGeneratorEnableSeparatorText.Text
source: Enable tokens separator
ru: Включить разделитель токенов
